Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: If we're looking at this point, as soon as these positive charges move in, a positive charge here that's right there is going to want to move there and a positive charge that's here is going to want to move to the right, but not as quickly because the the effect gets diffused, right?
ht: Si nou ap gade nan pwen sa, talè kòm sa chaj pozitif deplase nan, yon pozitif frais isit la sa a isit-la-pwal souhaitez pou yo avanse gen ak yon pozitif frais se isit la va pou nou vle pou avanse sou bò dwat, men pa kouri paske a efè obtient diffused, droit?

source: The impact on this charge is less than this charge because it's further away.
ht: Enpak sou akizasyon sa se pipiti ke akizasyon sa a paske li plus loin.

source: And we could think more, we could run computer simulations about it, but I think you get the general idea.
ht: E nou te kapab panse ankò, nou te kapab kouri simulations konpitè eskòte l, men mwen panse ke nou gen lide an jeneral.

source: Positive things flow in.
ht: Bagay pozitif flux nan.

source: Other positive things want to move away.
ht: Pozitif lòt bagay nou vle pou avanse ale.

source: That makes any point that's some distance away from that disruption a little bit more positive so it'll affect its voltage almost immediately.
ht: Sa fè kèk pwen ki pi byen lwen kite sa kondiktè koupe yon ti jan plis pozitif pou l' ap aji sou li vòltaj pwèske imedyatman.

source: So it's very fast, but the problem is it dissipates with distance.
ht: Poutèt sa trè vit, men, pwoblèm lan se li se ak byen lwen.

source: If we go really far from that-- if we went all the way down here, this guy would have almost no impact from what's happening at this opening of this sodium gate.
ht: Si nou vwèman manyè kite sa ­ si n' al jouk yo rive desann isit la, nèg sa a ta gen pwèske pa enpak de sa a se nan sa a ouverture de baryè odyòm sa a.

source: So that's its negative.
ht: Se poutèt sa se négatif li.

source: On the other hand, on the other side of the spectrum, we looked at action potentials.
ht: Nan lòt men an: sou lòt bò a spectre, nou gade aksyon potentiels.

source: Action potentials are all about-- you have some stimulus.
ht: Aksyon potentiels sont tout sou- ou gen kèk rezon.

source: In general, it's getting a little bit of a positive charge near a sodium gate.
ht: An jeneral, li koumanse yon ti yon pozitif frais tou pre yon baryè Sodyòm.

source: So normally, we're resting at minus 70 millvolts.
ht: Se konsa nòmalman, nou ap repoze nan moins 70 millvolts.

source: Maybe you have a little bit of a positive charge come, maybe through some type of electrotonic interaction, but that's not enough.
ht: Petèt ou gen yon ti pozitif chaj yon leve non, petèt à de electrotonic entèraksyon, men sa se poko sa toujou.

source: But maybe another one comes by and it gets you to minus 55 millvolts and then the gate opens, sodium floods in, we become much more positive.
ht: Men, gen dwa lòt vini lè li vin ou moins 55 millvolts Et puis baryè a s', odyòm inondasyon an, nou vin pi plis pozitif.

source: Then the sodium gates close.
ht: Lè sa a l' gates odyòm fèmen.

source: Potassium gates open.
ht: Potasyòm gates louvri.

source: The potassium wants to flow out of the cell because we're positive in the cell now and there's a lot of potassium on the inside because of the sodium potassium pumps.
ht: Potasyòm a vle flux soti nan selil a paske nou pozitif nan selil a kounye a Et la se yon bann Potasyòm L' poutèt pompes Potasyòm Sodyòm.

source: So then we go back to negative.
ht: Se konsa lè sa a nou tounen al jwenn negatif.

source: We actually overshoot.
ht: Nou aktyèlman dépassement.

source: And just in case you want to know, at this point, we're kind of in this refractory period.
ht: Et sèlman nan ka ou vle konnen: nan pwen sa a, nou ap ti jan nan tan réfractaires sa a.

source: And the original gate that just opened and closed-- it's deactivated for a short period of time.
ht: Baryè a orijinal ki tout ouvert Et fèmen - sa se gentan dezamòse pou yon kout tan de temps.

source: So there's some period of time that another stimulus won't be able to do it, but then our sodium potassium pumps can get us back to normal.
ht: Se konsa pa gen yon peryòd de tan sa p ap fè yon lòt rezon ka fè l, men lè sa a nou odyòm Potasyòm pompes nan kapab resevwa nou tounen nòmal.

source: But the whole time that that was happening, as the gate that was to the left got all charged up, as the sodium started flowing in, it's obviously going to make it a little bit more positive to the gate that's directly to the right of it.
ht: Men, tout tan lè sa a, sa ki te pase, tankou baryè a ki te sou bò gòch a tout akize, tankou Sodyòm a te kòmanse ap koule tankou dlo nan, sa evidamman ap fè l' yon ti kras plis pozitif pou baryè a se dirèkteman pou dwa sa a.

source: So the gate that's to the right of it, its charge is going to go slightly up and then bam, it hits its threshold for firing.
ht: Se konsa baryè a ki se bò dwat li, koute li se li pwal ale yon ti jan a, lè sa a bam yo, hits li pou sekirite sosyal pou tire.

source: So then that sodium gate opens and the same thing happens a little bit further to the right.
ht: Se konsa lè sa a, sa baryè odyòm s' Et menm bagay rive yon ti kras anplis pou dwa.

source: And I could keep doing that, maybe even a little bit further to right.
ht: Mwen te kapab toujou fè sa, petèt menm yon ti jan anplis pou dwa.

source: A gate's potential might look something like that and that's how it travels.
ht: Potansyèl baryè yon ta sanble yon bagay sa yo ak sa se afè jan li se.

source: Now the benefit of this is that the signal never loses strength, right?
ht: Koulye a sou benefis sa se sa siyal la pa janm perd force, dwat?

source: We can just keep going down the cell like this.
ht: Nou kapab sèlman kontinye sou menm lanse desann sèlil kon sa.

source: We could do that for millions of miles if we had to.
ht: Nou te kapab fè sa pou dè milyon de kilomèt si nou te gen pou yo.

source: The negative is that it's slower than electrotonic in that you have to open and close these gates and it also requires energy because you're always having to re-balance the charge potential between the inside and the outside of the cell.
ht: Négatif a sèke se plus pase electrotonic nan sa ou gen pou louvri fèmen gates sa yo ak li tou mande enèji paske ou toujou gen pou re-balance la charge potentiel ant à la Et la deyò sèlil a.

source: So we need to think about, how could a cell use both of these things to optimize those tradeoffs between signal dissipation and speed?
ht: Se poutèt sa, nou bezwen panse osijè de, jan te kapab yon selil itilize tou le de sa yo sa ki gen pou optimiser sa compromis ant siyal dissipation Et vitès?

source: And this is exactly what the neuron does do.
ht: Et sa se ekzateman kisa ewonn a te fè.

source: So let's go back.
ht: Se konsa an n tounen.

source: Now we're ready to close the loop and actually talk about the neuron.
ht: Koulye a, nou pwèt pou nou fèmen la boucle Et aktyèlman pale osijè de ewonn a.

source: So when I talked about a neuron getting excited on the dendrite-- if I zoom in on a dendrite-- let's say this is a dendrite's membrane right here.
ht: Se konsa, lè mwen te pale osijè de yon ewonn pou eksite sou a dendrite ­ si m rale sou yon dendrite - an n ap di sa a se yon dendrite a len droit isit la.

source: Let me zoom in on a dendrite.
ht: Kite m' rale sou yon dendrite.

source: So that's the dendrite right there.
ht: Se poutèt sa se dendrite la a.

source: Let's say that this is a drawing of that point right there.
ht: An n di ke sa se yon desen de sa montre la a.

source: When I say stimulated, what's happening is, some channel is being triggered, some gate is being opened.
ht: Lè m' di stimuler, sa k ap pase, kèk kanal te a, gen kèk baryè te ouvwi.

source: And so let's say that this is a sodium channel and it stimulates-- the stimulus, it could be-- like in our action potential-- it could be voltage gated.
ht: Se konsa nou di ke sa se yon chanèl Sodyòm Et sa stimule - motif a, li ta ka - kon nan aksyon nou potentiel-li ta ka vòltaj gated.

source: A higher voltage might cause it to happen.
ht: Yon pi gwo vòltaj te ka koze li pou sa pase.

source: It might be some chemical stimulus from some other terminal end of some other axon.
ht: Ta ka jwenn kèk rezon chimik nan yon lòt fin de fè de kèk lòt axon.

source: It could be pressure.
ht: Li ta ka bay/fè presyon.

source: It could be, who knows?
ht: Li ta ka, ki konnen?

source: It could be some molecule that stimulates it, but something is making a gate open and maybe it's a sodium gate and so positive charge is going to flood in here.
ht: Li ta ka gen kèk Molekil ki stimule l, men se yon bagay ap fè yon baryè louvri Et gen dwa se yon baryè Sodyòm Et Se konsa, frais pozitif pwal inondations isit la.

source: Positive charge is going to flow into the cell.
ht: A charge pozitif pwal flux nan selil a.

source: We know why it does that.
ht: Nou konnen poukisa li fè sa.

source: There's a lot of sodium on the outside.
ht: Pa gen anpil odyòm sou deyò.

source: That's what the sodium potassium pump does.
ht: Sa se ki odyòm ponp Potasyòm sa.

source: So positive charge flows into the cell.
ht: Se konsa pozitif frais flux nan selil a.

source: So immediately, it's going to have some impact.
ht: Se konsa imedyatman, li pwal gen yon enpak.

source: If we measure the voltage here, immediately the positive charge here is going to want to travel away and so this point is going to become a little bit more positive.
ht: Si nou mezire vòltaj la isit la, imedyatman pozitif frais isit la ap vle pou yo vwayaje ale Et sa sa pwen a pwal devni yon ti jan plis pozitif.

source: If we look at this point, it's going to become a little bit more positive, but it's so far away from the original reaction that maybe it doesn't become as positive because the ions are becoming dissipated as we go through the cell.
ht: Si nou gade nan pwen sa a, sa ap vin yon ti jan plis pozitif, men li a twò lwen kite orijinal la reyaksyon sa petèt li pa devenir tant pozitif paske a ions sont vin se menm jan nou pase nan selil a.

source: So as we go right here to our axon hillock, we have more gates.
ht: Se konsa jan nou ale isit-axon nou bit tè, nou gen plis gates.

source: Let's say that that's a sodium gate.
ht: An n di ke sa se yon baryè Sodyòm.

source: Let's say that this is a potassium gate.
ht: An n di ke sa se yon baryè Potasyòm.

source: Let's say that we have another sodium gate.
ht: An n di nou gen yon lòt odyòm baryè.

source: Doesn't have to be configured this way.
ht: Pa gen pou configuré chemen sa a.

source: We have another potassium gate right there.
ht: Nou gen yon lòt Potasyòm baryè la a.

source: Now if we just had one event here, we're so far away from that event that maybe if we measured the potential at that point, at the axon hillock-- remember, that's the little bulge that turns into the axon.
ht: Kounye a si nou jis te yon evènman isit la, nou ap twò lwen wete l ' nan evènman sa petèt sa si nou jwenn potentiel sa pwent (n), nan a axon bit tè - sonje, ki se anpil bonbe sa active nan axon la.

source: Let's do that same chart that I had before, where we have membrane potential.
ht: An n fè sa graphique tou sa mwen te ekri, kote nou gen len potansyèl.

source: So potential across the membrane.
ht: Se konsa potansyèl Sur la len.

source: And then we have time.
ht: Et, lè sa a, nou gen tan.

source: So if we look at this point-- let's say we're looking at this point right here, that point and we're comparing it to the outside of the membrane.
ht: Se konsa, si nou gade nan pwen sa ki an n pale nou ap gade pwent sa droit isit la, ke pwen Et nou ap pote l pou len a deyò.

source: So it's starting at minus 70 millivolts.
ht: Se konsa, li kòmanse nan moins 70 millivolts.

source: That's its resting.
ht: Sa se li rete.

source: And let's say that some event happened out here and electrotonically it's going to increase the potential a little bit because positive charge is going to make its way and they're all going to push each other.
ht: An n di ke kèk evènman te rive bò isit Et electrotonically sa ap ogmante de yon ti kras paske pozitif frais pwal fè li wout ak yo tout pral pouse ak lòt.

source: They're all going to get away from each other and this one's going to become slightly positive.
ht: Yo tout pral ka kite ak lòt, sa a yonn an pwal pou vin yon ti jan pozitif.

source: But let's say it only goes to minus 65, nothing happens.
ht: Men, ann di li al ka moins 65, pa gen anyen k rive koukouloukou.

source: Then your sodium potassium pumps come into effect so nothing really happened.
ht: Lè sa a, ou pompes Potasyòm odyòm antre an aplikasyon se konsa pa vrèman est.

source: It didn't trigger the neuron, but let's say that gets stimulated again and let's say there's a couple more that get stimulated and their combined effects-- because all of them are flooding with positive ions now-- their combined effects are enough to get this point to the threshold.
ht: Li pat itilize ewonn a, men an n di ke obtient stimuler ankò Et an n di gen se plis de sa te jwenn stimuler Et yo konbine efè - paske yo tout sont inondations ak pozitif ions koulye a - konbine yo efè yo kont pou jwenn sa a yon pwen pou sekirite sosyal la.

source: So they're enough to get this point to minus 55.
ht: Se konsa yo gen ase pou jwenn sa a montre moins 55.

source: And we know what's going to happen here.
ht: Et, nou konnen sa ki pwal pase isit lan.

source: As soon as this sodium gate gets to minus 55, it's going to open up.
ht: Pli vit ke baryè odyòm sa a gen pou moins 55, li pwal pou.

source: It's going to open up and sodium is going to flood in.
ht: Li pwal pou e Sodyòm pwal inondations nan.

source: Sodium is going to flood in until we get to positive 40. then it's going to close.
ht: Sodyòm pwal inondations nan jiskaske nou ale nan 40 pozitif. Lè sa a li pwal fèmen.

source: Then the potassium gate's going to open and get us back to where we were before.
ht: Lè sa a va baryè Potasyòm a louvri, fè nou tounen pou kote nou te anvan.

source: We're going to overshoot a little bit and then our sodium potassium pump's going to get back to where we wanted.
ht: Nou pral dépassement pou yon ti tan, lè sa a nou Sodyòm Potasyòm ponp a va tounen kote nou te vle nan.

source: That's going to happen there, but as the sodium is floating in into that first gate, this guy's going to become positive here and then this gate, this sodium gate, is going to become triggered.
ht: Sa se pwal pase la, men, tankou odyòm a flotan nan nan premye baryè sa, nèg sa a la pwal devni pozitif isit la, lè sa a, sa a gate, baryè odyòm sa a, va pou devenir a.

source: And this is that action potential idea.
ht: Et sa se lide potentiel aksyon sa.

source: Now, we could just keep going our action potential all the way down the axon because we said the benefit of the electrotonic is that it goes fast, but doesn't cover a lot of distance.
ht: Koulye a, nou te kapab sèlman kontinye sou menm lanse tout potentiel aksyon nou a manière desann axon la paske nou te di sou benefis de la electrotonic se sa li va fè vit, men pa kouvri anpil ki distans.

source: This is a relatively short distance, while the axon is super-long.
ht: Sa se yon relativement distans trè kout, pandan ke axon a se super-long.

source: So you might say, OK, I see, electrotonic from the dendrite to the axon hillock-- and then we use action potential all the way down the axon.
ht: Se poutèt sa, nou pa ka di, dakò, mwen wè, electrotonic de la dendrite pou axon a bit tè - Et lè sa a nou itilize aksyon potentiel tout koridò a anba axon a.

source: That would be reasonable because we're not going to lose our signal strength.
ht: Sa ta pran tèt nou paske nou pa pral pèdi tout siy defans nou.

source: We would keep having that domino, that chain reaction going all the way until we get to our terminal end, but the problem there is, it's slow.
ht: Nou ta toujou gen domino sa, reyaksyon chenn sa ale jouk yo rive jiskaske nou gen pou nou mouri de fè, men a gen pwoblèm se, pa fasil.

source: I mean, if this is a five foot long axon, I don't want to have a slow signal.
ht: Mwen vle di, si sa se yon axon tan senk pye, mwen pa vle pou yo gen yon siyal pa fasil.

source: If someone just bit me, I want to move my hand.
ht: Si yon moun annik pike m, mwen vle pou yo avanse nan men m.

source: If I just touched a stove, I want to move my hand quickly.
ht: Si mwen te jis manyen yon recho, mwen vle pou avanse men m' pou rapidement.

source: I don't want all that signal to take so much time, all these gates to open and close along the whole four or five feet-- of if I'm a dinosaur, move my arm.
ht: Mwen pat vle tout sa signal pou pran anpil tan, tout gates sa yo pou louvri fèmen nan tout ak kat ou senk pye-de si m' se yon dinozò, deplase bra m.

source: It needs to happen quickly.
ht: Li bezwen pou rive byen vit.

source: So what happens is that there's a combination.
ht: Se poutèt sa k rive koukouloukou se pou pa gen yon konbinezon. Ou jwenn siyal ou Et sa amplifies siyal la.

source: The signal is very weak here, right?
ht: Siyal la trè fèb isit la, droit?

source: It only got us to minus 55, but then when that first sodium gate opens, it creates a huge positive potential that opens the next gate.
ht: Li sèlman a nou moins 55, men puis lè premye sa odyòm baryè s', sa kreye yon gwo gwo pozitif ki s' baryè kap vini a.

source: So we have a huge positive potential here.
ht: Se konsa, nou gen yon gwo gwo pozitif isit la.

source: Now the axons have these huge spaces where they're covered up.
ht: Koulye a, axons yo gen yon gwo mache sa yo kote yo ap kouvri l '.

source: They're covered up by these Schwann cells or by these myelin sheaths.
ht: Yo ap kouvri l ' pa cellules Schwann sa yo, ou pa sa la sheaths.

source: So even if there are gates underneath them, they're useless.
ht: Se konsa menm si genyen gates anba les you pa itil.

source: They can't interface with the outside sodiums and potassiums.
ht: Yo pa kapab koòdone yo ak tout en sodiums Et potassiums.

source: So over this distance of the axon, you cannot have a straight-up action potential.
ht: Se konsa sou sa a distans de la axon, ou pa kapab fè yon gwo aksyon dwat pou leve.

source: What happened is, your action potential here, it made everything a lot more positive than it would have been had there not been that opening of the gate and now you can have an electrotonic effect again.
ht: Sa k te pase se, ou aksyon potentiel isit la, li te fè tout bagay pozitif anpil plis pase l' ta te gen pa gen ke ouverture de baryè a epi koulye a ou ka gen yon electrotonic effet ankò.

source: So you kind of boosted your signal.
ht: Se konsa ou ti jan jarèt siyal ou.

source: So now this might get to plus 40.
ht: Men koulye a sa a ka pran pou plus 40.

source: Maybe over here we only get to minus 50, but minus 50, once again is enough to trigger a sodium gate, which then makes everything really positive again.
ht: Gen dwa pase isit la nou sèlman ale moins 50, men, moins 50, une ankò se ase pou itilize yon baryè odyòm, ki fè lè sa a tou sa vrèman pozitif ankò.

source: It boosts the signal.
ht: Li augmente siyal la.

source: It makes everything positive again, then your potassium gates, everything, comes out of the cell again.
ht: Li fè fè tou sa pozitif ankò, lè sa a ou Potasyòm Gates, tout bagay, l' ap soti nan selil a tounen.

source: So everything gets back to normal, but it boosted the signal.
ht: Se konsa, tout bagay avalwa nòmal, men li jarèt siyal la.

source: Now electrotonically, this is super positive.
ht: Koulye a, electrotonically, sa super pozitif.

source: Now the electrotonic effect, if we go some distance down the axon, this'll be less positive, but it'll be just enough to trigger another action potential.
ht: Koulye a electrotonic efè, si nou desann byen lwen axon a, sa ap gen mwens pozitif, men li ap fè sèlman ase pou itilize yon lòt aksyon potentiel.

source: And then that happens again.
ht: Et puis sa rive ankò.

source: So we have this combination of action potentials with electrotonics.
ht: Se konsa nou gen sa a konbinezon de potentiels aksyon ak electrotonics.

source: So electrotonic-- this is very fast.
ht: Se konsa electrotonic - sa trè vit.

source: This is a fast interaction.
ht: Sa se yon bwat tou pwepare entèraksyon.

source: It happens immediately, but it dissipates as it covers distance.
ht: Sa k rive imedyatman, men, sa se menm jan, li kouvri distans.

source: So we can't have these nodes of Ranvier being super far from each other.
ht: Se poutèt sa, nou pa kapab fè sa noeuds de Ranvier ke super byen lwen de ak lòt.

source: They have to be just far enough so that when one action potential happens, that it's still enough to trigger the next one.
ht: Yo gen pou jis byen lwen ase li konsa, lè yon aksyon potentiel rive, se kont toujou pou gachèt apwe.

source: It's not going to boost its potential to plus 40, but as long as it boosts it to minus 55, we're still going to produce a signal to keep moving on.
ht: Li p ap pou li potansyèl pou yo plus 40, men tankou tan jan li augmente li pou moins 55, nou toujou pral pwodwi yon siyal pou kenbe fè.

source: So this is a really good tradeoff because we get fast, slow, but it boosts the signal.
ht: Se konsa, sa se yon bon se vre: paske nou fè jèn, pa fasil, men li augmente siyal la.

source: Fast signal dies down, but it's enough to essentially trigger this guy and then it boosts the signal.
ht: Siyal rapide mouri, men, se kont pou esansyèlman itilize sa a, lè sa a li augmente siyal la.

source: It's slow, but then we travel fast again.
ht: Pa fasil, men, lè sa a nou vwayaje vit ankò.

source: Signal dies, boosts the signal slow, and we keep traveling that way down the axon.
ht: Siyal mouri, renforce siyal a pa fasil, e nou kenbe vwayaje fason sa desann axon la.

source: And this is actually called a saltatory conduction.
ht: Et sa aktyèlman rele yon saltatory conduction.

source: I remember when I first learned this in biology class, they kind of talked about it.
ht: M chonje lè m lan premye di sa nan klas Biyoloji, yo te ti jan pale sou sa.

source: Somehow putting the myelin sheath there just magically made it happen faster and these things just hop from one action potential reaction to another, but that's not what's happening.
ht: Enpòt kijan mete a gaine la gen sèlman par fè sa konn rive pi vit Et sote jis kèk bagay sa yo ki nan reyaksyon potentiel aksyon pou yon lòt, men sa se pa sa k ap pase.

source: You're boosting the signal here with an action potential.
ht: Ou gen pou ranfòse a siyal la ak yon aksyon potentiel.

source: When these gates open, it becomes super positive.
ht: Lè gates sa yo louvri l' vin super pozitif.

source: When it becomes super positive here-- from a maybe not so positive trigger becomes super positive, that allows this point to become reasonably positive, enough to trigger the next reaction.
ht: Lè l' vin super pozitif ici-de petèt yon se pa konsa pozitif gachèt devient super pozitif, sa pèmèt sa pwen pou vin raisonnablement pozitif, ase pou itilize reyaksyon kap vini.

source: When that triggers, then it becomes super positive, makes this reasonably positive or less negative, it triggers the next one.
ht: Ki lè sa déclenche, lè sa a, li parèt tankou super pozitif, fait sa a raisonnablement pozitif ou mwens négatif, li déclenche UN kap vini an.

source: So it's a combination of action potentials that boosts the signal.
ht: Se konsa, li se yon konbinezon de potentiels aksyon sa augmente siyal la.

source: And electrotonic effects that move the signal, that gives us this saltatory conduction.
ht: Ak efè electrotonic ki deplase siyal, sa ban nou conduction saltatory sa a.
